Revit 2027 API
ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution Property
 "Analytical Surface Resolution"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution { get; }
Public Shared ReadOnly Property RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution {
	ForgeTypeId^ get ();
}
static member RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace